{"backend": "tensorflow", "config": [{"config": {"activity_regularizer": null, "activation": "relu", "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "name": "conv2d_1", "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 128, 128, 3], "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_1", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "name": "conv2d_2", "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "data_format": "channels_last", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_2", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "name": "conv2d_3", "kernel_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "padding": "valid", "bias_constraint": null, "data_format": "channels_last", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_3", "padding": "valid", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "units": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "seed": null, "trainable": true, "noise_shape": null, "rate": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.1.4"}